#+TITLE: Emacs Environment Configuration
#+SUBTITLE: One Of These Days, I'll Be Productive In Emacs
#+AUTHOR: Demis Balbach
#+PROPERTY: header-args :mkdirp yes
#+PROPERTY: header-args :tangle-mode (identity #o444)

This file includes the complete configuration for my Emacs setup. Although I have started an emacs config from scratch when I first got into emacs, I soon realized that there are great [[https://github.com/caisah/emacs.dz][pre-built configurations]] out there that save you a lot of time and head-scratching when delving into the rabbit hole that is Emacs.
However, pre-built configurations themselves can be a rabbit hole as the linked table hopefully shows. Personally, I settled with [[https://github.com/hlissner/doom-emacs][DOOM Emacs]] - it's a popular configuration and for good reason. I can't imagine going back to anything else at this point (This is a good thing?).

I like to have *one* file to configure Emacs. Hence why you  are reading a [[https://leanpub.com/lit-config/read][literate]] configuration. Not only documents it my configuration, it /is/ my configuration. It will tangle all of my configuration- or dotfiles on every save.

* Exported Files
  Tangling this file will create various directories and files in the home directory. However, I don't specify the target file for every source block individually, I rather declare file-local variables containing the target directories (I like [[https://en.wikipedia.org/wiki/Don%27t_repeat_yourself][DRY]]). Because I follow the [[https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html][XDG]] directory specification, I'll use the preferred defaults.
  I set all local variables in the [[#Local Variables][Local Variables]] footer of this file (View the raw file in order to see it).

  The following tables shows all the defined target directories. All exports are based on these. This table is auto-generated.

  #+name: filelist
  #+begin_src emacs-lisp :results value :exports results :tangle no
  (append
   `(("Variable" "Path") hline)
   (cl-loop for (e) on file-paths collect
	    (list (car e)
		  (concat "=" (prin1-to-string (cdr e) t) "="))))
  #+end_src

  #+RESULTS: filelist
  | Variable           | Path                              |
  |--------------------+-----------------------------------|
  | bindir             | =/home/db/.local/share/bin=       |
  | guix-manifest-home | =/home/db/.config/guix/manifests= |
  | guix-config-home   | =/home/db/.config/guix=           |
  | doomdir            | =/home/db/.config/doom=           |
  | npm-config-home    | =/home/db/.config/npm=            |
  | profiled-home      | =/home/db/.config/profile.d=      |
  | xdg-data-home      | =/home/db/.local/share=           |
  | xdg-config-home    | =/home/db/.config=                |

  I may refer to these directories throughout the configuration, e.g. like that: =doomdir/config.el=.

  #+begin_src scheme :tangle (concat (cdr (assoc 'guix-manifest-home file-paths)) "/emacs.scm") :noweb yes
  ;; This file is auto-generated. Do not make changes manually.
  ;; Exported from Emacs.org

  (specifications->manifest
   '(
     "emacs-pgtk-native-comp"
     <<packages>>
     ))
  #+end_src

